import React from "react"

export const CookiesPrivacyContent: React.FC = () => {
  return (
    <section className={"py-16"}>
      <div className={"container"}>
        <article className={"prose lg:prose-md w-full"}>
          <h1>Політика використання кукі</h1>

          <p>
            <strong>Останнє оновлення:</strong> [дата останнього оновлення]
          </p>

          <h2>Що таке файли cookie?</h2>

          <p>
            Файли cookie - це невеликі фрагменти даних, які зберігаються на вашому пристрої, коли ви
            відвідуєте веб-сайт. Вони допомагають веб-сайтам запам'ятовувати інформацію про вас,
            таку як ваші налаштування або інші налаштування, щоб забезпечити вам кращий досвід
            користувача при наступних відвідуваннях.
          </p>

          <h2>Використання нікнейму користувача для відправки файлів в Телеграм</h2>

          <p>
            Ми можемо використовувати файли cookie для зберігання нікнейму користувача, який він
            введе вручну на нашому веб-сайті для відправки оброблених файлів в Телеграм. Ця
            інформація використовуватиметься виключно для цієї цілі та не буде передаватися третім
            особам.
          </p>

          <h2>Як ви можете керувати файлами cookie?</h2>

          <p>
            Більшість веб-браузерів дозволяють вам керувати файли cookie через налаштування
            браузера. Ви можете налаштувати свій браузер так, щоб він блокував всі файли cookie, або
            сповіщавав вас, коли вони були створені. Зверніть увагу, що блокування файлів cookie
            може вплинути на ваш досвід користувача та функціональність веб-сайту.
          </p>

          <h2>Зміни в політиці використання кукі</h2>

          <p>
            Ми можемо періодично оновлювати цю політику використання кукі, тому ми радимо періодично
            переглядати цю сторінку, щоб бути в курсі змін. Останнє оновлення цієї політики
            використання кукі було зазначено вище.
          </p>

          <h2>Зв'язок з нами</h2>

          <p>
            Якщо у вас є будь-які питання щодо цієї політики використання кукі, будь ласка,
            зв'яжіться з нами за адресою [ваша адреса електронної пошти].
          </p>
        </article>
      </div>
    </section>
  )
}
