{
  "Common": {
    "convert": "Конвертувати",
    "remove_all": "Видалити всі"
  },
  "FileUpload": {
    "select_files": "Вибрати файли",
    "file_name": "Назва",
    "file_size": "Розмір",
    "file_type": "Тип",
    "convert_to": "Конвертувати в",
    "empty_list": "Список файлів порожній",
    "convert_history": "Історія конвертації цієї сесії",
    "converted_time": "Час конвертації",
    "total_size": "Загальний розмір",
    "send_to_telegram": "Автоматично надсилати конвертовані архіви до Telegram",
    "cookies_warn_description": "Якщо ви хочете використовувати цю опцію, вам потрібно прийняти",
    "cookies_warn_cookie": "політику використання cookie",
    "cookies_warn_dialog": "Якщо ви відхилили її раніше, відмітьте це для відкриття вікна погодження"
  },
  "Notify": {
    "error": "Помилка",
    "info": "Інформація",
    "success": "Успішно",
    "warning": "Попередження",
    "target_warn": "🎯 Оберіть цільовий формат, інакше ми заплутаємо сервер 😊",
    "max_files_warn": "📂 Ой! Можна конвертувати лише {quantity} файлів за раз!",
    "max_size_warn": "📏 Максимальний розмір файлу - {size}, файл {name} забагато важить! 🐘",
    "file_type_warn": "📄 Формат файлу {name} не підтримується 😢 Ми тільки вчимось 😇",
    "username_warn": "👤 Ім'я користувача не може бути порожнім. Введіть його!",
    "convert_error": "😕 Щось пішло не так з конвертацією файлів. Спробуйте ще раз 😇",
    "convert_success": "🎉 Ура! Файли успішно конвертовано 😻"
  },
  "DialogCookie": {
    "title": "🍪 Використання файлів cookie",
    "content": "Цей сайт використовує файли cookie для забезпечення найкращого досвіду користувача. Продовжуючи використання цього сайту, ви погоджуєтеся з нашою політикою використання файлів cookie.",
    "agree": "Я згоден(-а)",
    "disagree": "Ні, дякую",
    "learn_more": "Дізнатися більше"
  },
  "CookiesPrivacyContent": {
    "content": "<h1>Політика використання кукі</h1><p><strong>Останнє оновлення:</strong> {lastModify}<h2>Що таке файли cookie?</h2><p>Файли cookie - це невеликі фрагменти даних, які зберігаються на вашому пристрої, коли ви відвідуєте веб-сайт. Вони допомагають веб-сайтам запам'ятовувати інформацію про вас, таку як ваші налаштування або інші налаштування, щоб забезпечити вам кращий досвід користувача при наступних відвідуваннях.<h2>Використання ідентифікатору чату користувача для відправки файлів в Телеграм</h2><p>Ми можемо використовувати файли cookie для зберігання ідентифікатору користувача, який він введе вручну на нашому веб-сайті для відправки оброблених файлів в Телеграм у ваші особисті повідомлення. Ця інформація використовуватиметься виключно для цієї цілі та не буде передаватися третім особам.<h2>Як ви можете керувати файлами cookie?</h2><p>Більшість веб-браузерів дозволяють вам керувати файли cookie через налаштування браузера. Ви можете налаштувати свій браузер так, щоб він блокував всі файли cookie, або сповіщавав вас, коли вони були створені. Зверніть увагу, що блокування файлів cookie може вплинути на ваш досвід користувача та функціональність веб-сайту.<h2>Зміни в політиці використання кукі</h2><p>Ми можемо періодично оновлювати цю політику використання кукі, тому ми радимо періодично переглядати цю сторінку, щоб бути в курсі змін. Останнє оновлення цієї політики використання кукі було зазначено вище.<h2>Зв'язок з нами</h2><p>Якщо у вас є будь-які питання щодо цієї політики використання кукі, будь ласка, зв'яжіться з нами за адресою <a href=mailto:yaroslav.honchar.1@gmail.com>yaroslav.honchar.1@gmail.com</a>."
  },
  "TelegramGroupIdContent": {
    "content": "<h1>Створення групи в Telegram та отримання її ID</h1><ol><li><h3>Створіть групу в Telegram</h3><p>Відкрийте Telegram, створіть нову групу і запрошуйте учасників, натискаючи на іконку створення нового чату (значок олівця).</p></li><li><h3>Додайте бота до групи для отримання ідентифікатора</h3><p>Додайте до вашої групи бота, наприклад, <code>@chatIDrobot</code>, інструкції як це зробити знайдете в інтернеті.</p><p>Бот автоматично відправить повідомлення у групу, в якому буде вказано інформацію про групу, включаючи її ідентифікатор.</p><pre class=\"w-fit rounded-2xl\"><code>👤 name: Group name<br />📱 chat_id: <mark class=\"text-gray-800 bg-blue-200\"> -1001234567890 </mark> <br />🔗 invite_link: <br />👆 For get invite link, Bot most be admin in this group.</code></pre><p>Після отримання ID групи ви можете видалити бота з групи.</p></li></ol>"
  }
}
